# Запросите у пользователя ФИО Данные и возраст и сохраните их в двух переменных.
# Вывести на экран таким образом: "Здравствуйте ФИО, вам возраст лет."

# name = input("Введите ваши ФИО: ")
# age = int(input("Введите ваш возраст: "))
# print("Здравствуйте", name, ", вам ",age,"лет")
# print(f"Здравствуйте {name}, вам {age} лет.")

# number = "53 532 1 5354 3543 5 2 4 5 64 7 7876 841 634 5 32 543 1654 76 8768 68 746 34 534 5134 356 67 463"
# print(number.count("1"))

# name = "GeeksOSH"
#     #   01234567
# # print(name[5])
# print(name[0:8])

# Создайте переменную text и внутри передайте текс.
# Посчитайте индексы сделайте срез от 3 до 10

#попробуйте вывести текст - format()

# text = "Встроенная функция format()"
# print(text[11:18])
# # print(text.index("ия"))

#1) str - "Строка"
#2) int = "Целые числа"
#3) float = "числа с остатком или числа с точкой"
#4) bool =  "True and False"

# запросите у пользователя 2 числа с типом данных str после перобразуйте его в тип данных int и вывести результат после деления

# str_num1 = input("Введите первое число: ")
# str_num2 = input("Введите второе число: ")

# int_num1 = int(str_num1)
# int_num2 = int(str_num2)

# print(int_num1/int_num2)
